{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "131"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "41"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "131"}, {"size": "160"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_8_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}, {"size": "200"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_8_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_9_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "240"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_9_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_1_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_1_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_10_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}, {"size": "240"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_10_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_11_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}, {"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_11_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_12_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_12_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_13_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}, {"size": "41"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_13_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "41"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "131"}]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Relu", "op": "_FusedMatMul", "input": ["inputs", "StatefulPartitionedCall/sequential_1_1/dense_7_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_7_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_8_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_7_1/Relu", "StatefulPartitionedCall/sequential_1_1/dense_8_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_8_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_9_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_8_1/Relu", "StatefulPartitionedCall/sequential_1_1/dense_9_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_9_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_9_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1_1/dense_9_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_1_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_9_1/Tanh", "StatefulPartitionedCall/sequential_1_1/batch_normalization_1_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_1_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_1_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/batch_normalization_1_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_10_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_1_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_1_1/dense_10_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_10_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_10_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1_1/dense_10_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_11_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_10_1/Tanh", "StatefulPartitionedCall/sequential_1_1/dense_11_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_11_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_12_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_11_1/Relu", "StatefulPartitionedCall/sequential_1_1/dense_12_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_12_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_13_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_12_1/Relu", "StatefulPartitionedCall/sequential_1_1/dense_13_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_13_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_13_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_1_1/dense_13_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1_1/dense_13_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Cast/ReadVariableOp", "shape": [131, 160], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Add/ReadVariableOp", "shape": [160], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_8_1/Cast/ReadVariableOp", "shape": [160, 200], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_8_1/Add/ReadVariableOp", "shape": [200], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_9_1/Cast/ReadVariableOp", "shape": [200, 240], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_9_1/Add/ReadVariableOp", "shape": [240], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_1_1/batchnorm/mul", "shape": [240], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_1_1/batchnorm/sub", "shape": [240], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_10_1/Cast/ReadVariableOp", "shape": [240, 240], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_10_1/Add/ReadVariableOp", "shape": [240], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_11_1/Cast/ReadVariableOp", "shape": [240, 200], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_11_1/Add/ReadVariableOp", "shape": [200], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_12_1/Cast/ReadVariableOp", "shape": [200, 160], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_12_1/Add/ReadVariableOp", "shape": [160], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_13_1/Cast/ReadVariableOp", "shape": [160, 41], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_13_1/Add/ReadVariableOp", "shape": [41], "dtype": "float32"}]}]}